GHB2/src/Catalogs/гхб_ФизическиеЛицаБазХолдинга/гхб_ФизическиеЛицаБазХолдинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ФизическиеЛицаБазХолдинга</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>GUIDБазыХолдинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицоТекущейБазы</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоменноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияЭлементаОбменом</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.гхб_ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчетДляВыплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СКР_ДляВыплатНаБанк</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРусское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетСоответствияВУчетныхБазах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_ФизическиеЛицаБазХолдинга/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		гхб_ОбщегоНазначенияСервер.СообщитьОЗапретеСозданияЭлементаСправочника(Отказ);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.ДекорацияДатаРождения.Видимость = ЗначениеЗаполнено(Объект.ДатаРождения);
	Если Элементы.ДекорацияДатаРождения.Видимость Тогда
		Элементы.ДекорацияДатаРождения.Заголовок = "Дата рождения(число, месяц): " + Формат(Объект.ДатаРождения, "ДФ='dd MMMM'")
	КонецЕсли;
	
	Элементы.ДатаРождения.Видимость = гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("ПолныеПрава") Или гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("гхб_ПолныйПросмотр");
	Элементы.РасчетныйСчетДляВыплат.Видимость = гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("ПолныеПрава") Или гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("гхб_ПолныйПросмотр");
	Элементы.СКР_ДляВыплатНаБанк.Видимость = гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("ПолныеПрава") Или гхб_ОбщегоНазначенияСервер.ПроверитьДоступностьРоли("гхб_ПолныйПросмотр");
	
КонецПроцедуры

#КонецОбласти
